app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Essa porra"], ["user_id", 1], ["created_at", "2020-07-20 16:02:56.326359"], ["updated_at", "2020-07-20 16:02:56.326359"]]
---
    def create
        message = current_user.messages.build(message_params)
        if message.save